Auction_authenticate/app/controllers/products_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def index
    @user = User.find_by(id: params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "products".* FROM "products" WHERE "products"."user_id" = ? AND "products"."id" = ? LIMIT 1  [["user_id", 6], ["id", 1]]
---
  def show
    @user = User.find_by(id: params[:user_id])
    @product = @user.products.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def new
    @user = User.find_by(id: params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "products" ("title", "description", "deadline", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.find_by(id: params[:user_id])
    @product = @user.products.new(entry_params)

    if(@product.save)