Auction_authenticate/app/controllers/reviews_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("user_id", "description", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 6], ["description", "me gusta la coca coooola"], ["product_id", 1], ["created_at", "2015-12-02 14:20:49.953250"], ["updated_at", "2015-12-02 14:20:49.953250"]]
---
	def create
		description = params[:review][:description]

		user = User.find_by(id: params[:user_id])
		product = Product.find_by(id: params[:product_id])

		@review = product.reviews.new(user_id: user.id, description: description, product_id: product.id)

		if @review.save