Auction_authenticate/app/controllers/users_controller.rb

  def index
    @users = User.all.order("name ASC")
---
SELECT "users".* FROM "users"  ORDER BY name ASC

  def create
    @user = User.new(entry_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "David"], ["email", "david"], ["created_at", "2015-12-01 13:37:55.853224"], ["updated_at", "2015-12-01 13:37:55.853224"]]